Tekla.Structures.Drawing.StraightDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double)
Creates a new straight dimension instance. Uses "standard" attributes for the creation.
targetView: The target view of the dimension.
startPoint: The start point of the dimension.
endPoint: The end point of the dimension.
upDirection: The up direction.
distance: The height of the dimension.

Tekla.Structures.Drawing.StraightDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes)
Creates a new straight dimension instance.
targetView: The target view of the dimension.
startPoint: The start point of the dimension.
endPoint: The end point of the dimension.
upDirection: The up direction.
distance: The height of the dimension.
attributes: The dimension attributes.

Tekla.Structures.Drawing.StraightDimension.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.StraightDimension.DimensionSetAttributes
All attributes of the dimension, that are actually the same as the dimension sets.

Tekla.Structures.Drawing.StraightDimension.UnFormattedMark
The dimension value string

Tekla.Structures.Drawing.StraightDimension.StartPoint
The start point of the dimension.

Tekla.Structures.Drawing.StraightDimension.EndPoint
The end point of the dimension.

Tekla.Structures.Drawing.StraightDimension.Value
The content of the dimension mark.

Tekla.Structures.Drawing.StraightDimension.Attributes
The dimension's attributes.

Tekla.Structures.Drawing.StraightDimension.Distance
The distance of the dimension line from the start point of the dimension.

Tekla.Structures.Drawing.StraightDimension.UpDirection
The direction from the dimension points to the dimension line.